Sintaxe nomeada da ACL IPv4 padrão

Método do Editor de Texto
ACLs com várias ACEs devem ser criadas em um editor de texto. Isso permite planejar as ACEs necessárias, criar a ACL e colá-la na interface do roteador. Ele também simplifica as tarefas para editar e corrigir uma ACL.

Por exemplo, suponha que a ACL 1 foi inserida incorretamente usando 19 em vez de 192 para o primeiro octeto, como mostrado na configuração em execução.

R1# show run | section access-list
access-list 1 deny 19.168.10.10
access-list 1 permit 192.168.10.0 0.0.0.255
R1#
No exemplo, a primeira ACE deveria ter sido negar o host em 192.168.10.10. No entanto, a ACE foi inserida incorretamente.

Para corrigir o erro:

Copie a ACL da configuração em execução e cole-a no editor de texto.
Faça as alterações necessárias.
Remova a ACL configurada anteriormente no roteador. Caso contrário, a colação dos comandos ACL editados só acrescentará (isto é, adicionar) aos Aces ACL existentes no roteador.
Copie e cole a ACL editada de volta para o roteador.
Suponha que a ACL 1 foi corrigida. Portanto, a ACL incorreta deve ser excluída e as instruções ACL 1 corrigidas devem ser coladas no modo de configuração global, conforme mostrado na saída.

R1(config)# no access-list 1
R1(config)#
R1(config)# access-list 1 deny 19.168.10.10
R1(config)# access-list 1 permit 192.168.10.0 0.0.0.255
R1(config)#
Concluída 4.4.3 Método de número de seqüência4.4.3 Método de número de seqüência
Uma ACL ACE também pode ser excluída ou adicionada usando os números de sequência ACL. Os números de sequência são atribuídos automaticamente quando uma ACE é inserida. Esses números são alistados no comando show access-lists . O comando show running-config não exibe a sequência de números.

No exemplo anterior, a ACE incorreta para ACL 1 está usando o número de seqüência 10, como mostrado no exemplo.

R1# show access-lists
Standard IP access list 1
   10 deny 19.168.10.10
   20 permit 192.168.10.0, wildcard bits 0.0.0.255
R1#
Utilize o comando ip access-list standard para editar uma ACL. As instruções não podem ser substituídas usando o mesmo número de sequência que uma instrução existente. Portanto, a declaração atual deverá excluir os primeiros com o comando no 10 . Em seguida, a ACE correta pode ser adicionada usando o número de sequência 10 é configurado. Verifique as mudanças utilizando o comando show access-lists .

R1# conf t
R1(config)# ip access-list standard 1
R1(config-std-nacl)# no 10
R1(config-std-nacl)# 10 deny host 192.168.10.10
R1(config-std-nacl)# end
R1# show access-lists
Standard IP access list 1
   10 deny 192.168.10.10
   20 permit 192.168.10.0, wildcard bits 0.0.0.255
R1#
Incompleta 4.4.4 Verificar de Sintaxe - Modificar ACLs IPv4

Use the show access-lists command to verify the configured ACLs.

R1#show access-lists
Standard IP access list 1
    10 deny   19.168.10.10
    20 permit 192.168.10.0, wildcard bits 0.0.0.255
You notice that ACE 10 is incorrect and needs to be edited. Enter global configuration mode and use the ip access-list standard command for ACL 1.

R1#configure terminal
R1(config)#ip access-list standard 1
An incorrect ACE must be deleted and then re-entered. Remove the ACE with sequence number 10.

R1(config-std-nacl)#no 10
Next, re-enter the correct ACE using sequence number 10 to deny the host with the IP address 192.168.10.10 access outside of LAN 1 and return to privileged EXEC mode using the end command.

R1(config-std-nacl)#10 deny host 192.168.10.10
R1(config-std-nacl)#end
Verify the new entry using the show access-lists command.

R1#show access-lists
Standard IP access list 1
    10 deny   192.168.10.10
    20 permit 192.168.10.0, wildcard bits 0.0.0.255
You have successfully modified an IPv4 numbered ACL on R1.

